In [34]:
import pandas as pd
import requests as rq
import json

arq = "https://raw.githubusercontent.com/FranciscoFoz/7_Days_of_Code_Alura-Python-Pandas/main/Dia_6-Novos_dados_novas_analises/Datasets/cadastro_alunos.json"

#Resposta = rq.get(arq)

df = pd.read_json(arq)# importa um arquivo json


df_Graduacao = pd.read_json(df.registros[0])#o arquivo json tinha outros 2 dentro dele, então, peguei o da linha 0 e reimportei
df_POSGraduacao = pd.read_json(df.registros[1])# registros é o nome da coluna que estava o conteudo dos json, na linha 0 e 1
df_todos = df_Graduacao.merge(df_POSGraduacao, how="outer")#uni os dois dataframe, acrescentando o POSgradução no final do Graduação
df_todos

,matricula_ou_siape,tipo_vinculo_usuario,curso
0,2009029003,ALUNO DE GRADUAÇÃO,FILOSOFIA
1,200617346,ALUNO DE GRADUAÇÃO,DIREITO
2,200746502,ALUNO DE GRADUAÇÃO,ENGENHARIA DE PETRÓLEO
3,200504968,ALUNO DE GRADUAÇÃO,ADMINISTRAÇÃO
4,200615572,ALUNO DE GRADUAÇÃO,CIÊNCIA DA COMPUTAÇÃO
...,...,...,...
82237,20201013501,ALUNO DE PÓS-GRADUAÇÃO,GESTÃO DA INFORMAÇÃO E DO CONHECIMENTO
82238,20201014062,ALUNO DE PÓS-GRADUAÇÃO,"CIÊNCIA, TECNOLOGIA E INOVAÇÃO"
82239,20201017690,ALUNO DE PÓS-GRADUAÇÃO,CIÊNCIAS DA SAÚDE
82240,20201014465,ALUNO DE PÓS-GRADUAÇÃO,DESIGN
82241,20201014993,ALUNO DE PÓS-GRADUAÇÃO,DESIGN

In [35]:
df_excel = pd.read_excel("matricula_alunos.xlsx")# importei o arquivo excel
df_excel.columns = df_excel.iloc[0] # defini a linha 0 como coluna
df_excel = df_excel[1:]#agrega os valores iniciando da linha 1 a linha 0 virou coluna então pode ser descartada
df_excel["Número da matrícula"] = df_excel["Número da matrícula"].str.replace('.0', '')#troca o ".0" da coluna por "", só funciona em str

,Número da matrícula,Tipo de vinculo,Curso
1,190001688,ALUNO DE GRADUAÇÃO,MATEMÁTICA
2,199014489,ALUNO DE GRADUAÇÃO,CIÊNCIAS BIOLÓGICAS
3,199735674,ALUNO DE GRADUAÇÃO,MATEMÁTICA
4,199812431,ALUNO DE GRADUAÇÃO,LETRAS
5,199823670,ALUNO DE GRADUAÇÃO,ECOLOGIA
...,...,...,...
7722,2009075211,ALUNO DE GRADUAÇÃO,BIBLIOTECONOMIA
7723,2009075249,ALUNO DE GRADUAÇÃO,ANÁLISE E DESENVOLVIMENTO DE SISTEMAS
7724,2009075294,ALUNO DE GRADUAÇÃO,ADMINISTRAÇÃO
7725,2009075300,ALUNO DE GRADUAÇÃO,MÚSICA
7726,2009075329,ALUNO DE GRADUAÇÃO,DIREITO